PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_usart_com.h
/*!
    \file    gd32f3x0_hal_usart_com.h
    \brief   common definitions for the USART

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32F3X0_HAL_USART_COM_H
#define GD32F3X0_HAL_USART_COM_H

#include "gd32f3x0_hal.h"

#define USART0                        (0x40013800UL)
#define USART1                        (0x40004400UL)

/* registers definitions */
#define USART_CTL0(usartx)            REG32((usartx) + 0x00000000U)         /*!< USART control register 0 */
#define USART_CTL1(usartx)            REG32((usartx) + 0x00000004U)         /*!< USART control register 1 */
#define USART_CTL2(usartx)            REG32((usartx) + 0x00000008U)         /*!< USART control register 2 */
#define USART_BAUD(usartx)            REG32((usartx) + 0x0000000CU)         /*!< USART baud rate register */
#define USART_GP(usartx)              REG32((usartx) + 0x00000010U)         /*!< USART guard time and prescaler register */
#define USART_RT(usartx)              REG32((usartx) + 0x00000014U)         /*!< USART receiver timeout register */
#define USART_CMD(usartx)             REG32((usartx) + 0x00000018U)         /*!< USART command register */
#define USART_STAT(usartx)            REG32((usartx) + 0x0000001CU)         /*!< USART status register */
#define USART_INTC(usartx)            REG32((usartx) + 0x00000020U)         /*!< USART status clear register */
#define USART_RDATA(usartx)           REG32((usartx) + 0x00000024U)         /*!< USART receive data register */
#define USART_TDATA(usartx)           REG32((usartx) + 0x00000028U)         /*!< USART transmit data register */
#define USART_RFCS(usartx)            REG32((usartx) + 0x000000D0U)         /*!< USART receive FIFO control and status register */

/* bits definitions */
/* USARTx_CTL0 */
#define USART_CTL0_UEN                BIT(0)                                /*!< enable USART */
#define USART_CTL0_UESM               BIT(1)                                /*!< enable USART in deep-sleep mode */
#define USART_CTL0_REN                BIT(2)                                /*!< enable receiver */
#define USART_CTL0_TEN                BIT(3)                                /*!< enable transmitter */
#define USART_CTL0_IDLEIE             BIT(4)                                /*!< enable idle line detected interrupt */
#define USART_CTL0_RBNEIE             BIT(5)                                /*!< enable read data buffer not empty interrupt and overrun error interrupt */
#define USART_CTL0_TCIE               BIT(6)                                /*!< enable transmission complete interrupt */
#define USART_CTL0_TBEIE              BIT(7)                                /*!< enable transmitter register empty interrupt */
#define USART_CTL0_PERRIE             BIT(8)                                /*!< enable parity error interrupt */
#define USART_CTL0_PM                 BIT(9)                                /*!< parity mode */
#define USART_CTL0_PCEN               BIT(10)                               /*!< enable parity control */
#define USART_CTL0_WM                 BIT(11)                               /*!< wakeup method in mute mode */
#define USART_CTL0_WL                 BIT(12)                               /*!< word length */
#define USART_CTL0_MEN                BIT(13)                               /*!< enable mute mode */
#define USART_CTL0_AMIE               BIT(14)                               /*!< enable address match interrupt */
#define USART_CTL0_OVSMOD             BIT(15)                               /*!< oversample mode */
#define USART_CTL0_DED                BITS(16,20)                           /*!< enable driver deassertion time */
#define USART_CTL0_DEA                BITS(21,25)                           /*!< enable driver assertion time */
#define USART_CTL0_RTIE               BIT(26)                               /*!< enable receiver timeout interrupt */
#define USART_CTL0_EBIE               BIT(27)                               /*!< enable end of block interrupt */

/* USARTx_CTL1 */
#define USART_CTL1_ADDM               BIT(4)                                /*!< address detection mode */
#define USART_CTL1_LBLEN              BIT(5)                                /*!< LIN break frame length */
#define USART_CTL1_LBDIE              BIT(6)                                /*!< enable LIN break detection interrupt */
#define USART_CTL1_CLEN               BIT(8)                                /*!< last bit clock pulse */
#define USART_CTL1_CPH                BIT(9)                                /*!< clock phase */
#define USART_CTL1_CPL                BIT(10)                               /*!< clock polarity */
#define USART_CTL1_CKEN               BIT(11)                               /*!< enable ck pin */
#define USART_CTL1_STB                BITS(12,13)                           /*!< stop bits length */
#define USART_CTL1_LMEN               BIT(14)                               /*!< enable LIN mode */
#define USART_CTL1_STRP               BIT(15)                               /*!< swap TX/RX pins */
#define USART_CTL1_RINV               BIT(16)                               /*!< RX pin level inversion */
#define USART_CTL1_TINV               BIT(17)                               /*!< TX pin level inversion */
#define USART_CTL1_DINV               BIT(18)                               /*!< data bit level inversion */
#define USART_CTL1_MSBF               BIT(19)                               /*!< most significant bit first */
#define USART_CTL1_RTEN               BIT(23)                               /*!< enable receiver timeout */
#define USART_CTL1_ADDR               BITS(24,31)                           /*!< address of the USART terminal */

/* USARTx_CTL2 */
#define USART_CTL2_ERRIE              BIT(0)          /*!< enable error interrupt in multibuffer communication */
#define USART_CTL2_IREN               BIT(1)          /*!< enable IrDA mode */
#define USART_CTL2_IRLP               BIT(2)          /*!< IrDA low-power */
#define USART_CTL2_HDEN               BIT(3)          /*!< enable half-duplex */
#define USART_CTL2_NKEN               BIT(4)          /*!< enable NACK in smartcard mode */
#define USART_CTL2_SCEN               BIT(5)          /*!< enable smartcard mode */
#define USART_CTL2_DENR               BIT(6)          /*!< enable DMA for reception */
#define USART_CTL2_DENT               BIT(7)          /*!< enable DMA for transmission */
#define USART_CTL2_RTSEN              BIT(8)          /*!< enable RTS */
#define USART_CTL2_CTSEN              BIT(9)          /*!< enable CTS */
#define USART_CTL2_CTSIE              BIT(10)         /*!< enable CTS interrupt */
#define USART_CTL2_OSB                BIT(11)         /*!< one sample bit mode */
#define USART_CTL2_OVRD               BIT(12)         /*!< disable overrun */
#define USART_CTL2_DDRE               BIT(13)         /*!< disable DMA on reception error */
#define USART_CTL2_DEM                BIT(14)         /*!< enable driver mode */
#define USART_CTL2_DEP                BIT(15)         /*!< enable driver polarity mode */
#define USART_CTL2_SCRTNUM            BITS(17,19)     /*!< smartcard auto-retry number */
#define USART_CTL2_WUM                BITS(20,21)     /*!< wakeup mode from deep-sleep mode */
#define USART_CTL2_WUIE               BIT(22)         /*!< enable wakeup from deep-sleep mode interrupt */

