PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_usart_com.h
/* enable USART IrDA low-power */
#define CTL2_IRLP(regval)             (BIT(2) & ((uint32_t)(regval) << 2))
#define USART_IRLP_LOW                CTL2_IRLP(1)                          /*!< low-power */
#define USART_IRLP_NORMAL             CTL2_IRLP(0)                          /*!< normal */

/* configure USART DMA request for receive */
#define CTL2_DENR(regval)             (BIT(6) & ((uint32_t)(regval) << 6))
#define USART_RECEIVE_DMA_ENABLE      CTL2_DENR(1)                          /*!< DMA request enable for reception */
#define USART_RECEIVE_DMA_DISABLE     CTL2_DENR(0)                          /*!< DMA request disable for reception */

/* configure USART DMA request for transmission */
#define CTL2_DENT(regval)             (BIT(7) & ((uint32_t)(regval) << 7))
#define USART_TRANSMIT_DMA_ENABLE     CTL2_DENT(1)                          /*!< DMA request enable for transmission */
#define USART_TRANSMIT_DMA_DISABLE    CTL2_DENT(0)                          /*!< DMA request disable for transmission */

/* configure USART RTS hardware flow control */
#define CTL2_RTSEN(regval)            (BIT(8) & ((uint32_t)(regval) << 8))
#define USART_RTS_ENABLE              CTL2_RTSEN(1)                         /*!< enable RTS hardware flow control */
#define USART_RTS_DISABLE             CTL2_RTSEN(0)                         /*!< disable RTS hardware flow control */

/* configure USART CTS hardware flow control */
#define CTL2_CTSEN(regval)            (BIT(9) & ((uint32_t)(regval) << 9))
#define USART_CTS_ENABLE              CTL2_CTSEN(1)                         /*!< enable CTS hardware flow control */
#define USART_CTS_DISABLE             CTL2_CTSEN(0)                         /*!< disable CTS hardware flow control */

/* configure USART one sample bit method */
#define CTL2_OSB(regval)              (BIT(11) & ((uint32_t)(regval) << 11))
#define USART_OSB_1BIT                CTL2_OSB(1)                           /*!< 1 sample bit */
#define USART_OSB_3BIT                CTL2_OSB(0)                           /*!< 3 sample bits */

/* USART driver enable polarity mode */
#define CTL2_DEP(regval)              (BIT(15) & ((uint32_t)(regval) << 15))
#define USART_DEP_HIGH                CTL2_DEP(0)                           /*!< DE signal is active high */
#define USART_DEP_LOW                 CTL2_DEP(1)                           /*!< DE signal is active low */

/* USART wakeup mode from deep-sleep mode */
#define CTL2_WUM(regval)              (BITS(20,21) & ((uint32_t)(regval) << 20))
#define USART_WUM_ADDR                CTL2_WUM(0)                           /*!< WUF active on address match */
#define USART_WUM_STARTB              CTL2_WUM(2)                           /*!< WUF active on start bit */
#define USART_WUM_RBNE                CTL2_WUM(3)                           /*!< WUF active on RBNE */

#endif /* GD32F3X0_HAL_USART_COM_H */
